src/Catalogs/уатПрофилиОбменаСВнешнимиСистемами/уатПрофилиОбменаСВнешнимиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПрофилиОбменаСВнешнимиСистемами</name>
  <comment>(уат)</comment>
  <predefined>
    <items>
      <name>Автодор</name>
      <description>Автодор</description>
    </items>
    <items>
      <name>Газпромнефть</name>
      <description>Газпромнефть</description>
    </items>
    <items>
      <name>Лукойл</name>
      <description>Лукойл</description>
    </items>
    <items>
      <name>ПлатонВыпискаОпераций</name>
      <description>Платон (Выписка операций)</description>
    </items>
    <items>
      <name>ПлатонЛогистическийОтчет</name>
      <description>Платон (Логистический отчет)</description>
    </items>
    <items>
      <name>ППР</name>
      <description>ППР</description>
    </items>
    <items>
      <name>Роснефть</name>
      <description>Топливные карты Роснефть</description>
    </items>
  </predefined>
  <attributes>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.уатВнешниеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаПоискаПЛДоВыезда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаПоискаПЛПослеВозвращения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменятьАналогНаОсновноеТопливо</name>
    <comment>Заменять аналог на основное топливо (уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментироватьХодВыполнения</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьРассчитанныеПутевыеЛисты</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьФормыЗаписанныхЗаправок</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитатьПутевыеЛисты</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаличееДублейПоСозданнымРанееДокументам</name>
    <comment>(уат)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьСозданныеЗаправкиГСМ</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьСливыДляОтрицательныхЗаправок</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСистемы</name>
    <type>
      <types>EnumRef.уатТипыВнешнихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоответствияКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПроверенные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНаценкиСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеКолонок</name>
    <attributes>
      <name>КолонкаДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонкиФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаДокументаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКолонкиФайла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеВсегда</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/уатТипыВнешнихСистем/уатТипыВнешнихСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатТипыВнешнихСистем</name>
  <comment>Типы внешних систем (уат)</comment>
  <enumValues>
    <name>СистемаМониторинга</name>
    <comment>Система мониторинга.</comment>
  </enumValues>
  <enumValues>
    <name>ПроцессинговыйЦентр</name>
    <comment>Процессинговый центр.</comment>
  </enumValues>
  <enumValues>
    <name>СистемаВзиманияПлаты</name>
    <comment>Система взимания платы.</comment>
  </enumValues>
  <enumValues>
    <name>СервисШтрафов</name>
    <comment>Сервис штрафов</comment>
  </enumValues>
  <enumValues>
    <name>СервисПарковок</name>
    <comment>Сервис парковок</comment>
  </enumValues>
  <enumValues>
    <name>СервисСтрахования</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатПрофилиОбменаСВнешнимиСистемами/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;

	Элементы.ТипСистемы.СписокВыбора.Очистить();
	Элементы.ТипСистемы.СписокВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр);
	Элементы.ТипСистемы.СписокВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты);
	
	ИспользоватьСтрахование = ПолучитьФункциональнуюОпцию("уатИспользоватьСтрахование_уэ");
	Если ИспользоватьСтрахование Тогда
		Элементы.ТипСистемы.СписокВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СервисСтрахования);
	КонецЕсли;

	ИспользоватьМониторинг = ПолучитьФункциональнуюОпцию("уатИспользоватьМониторинг");
	Если ИспользоватьМониторинг Тогда
		Элементы.ТипСистемы.СписокВыбора.Добавить(Перечисления.уатТипыВнешнихСистем.СистемаМониторинга);
	КонецЕсли;
	
	Если Объект.СоответствиеКолонок.Количество() = 0 Тогда
		ИнициализацияСоответствияКолонок();
	КонецЕсли;
	
	Если Параметры.Свойство("Режим") Тогда
		Если Параметры.Режим = 2 Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗагрузкаЗаправок;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСистемыПриИзменении(Элемент)
	
	Если Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаВзиманияПлаты")
		И уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.ПроцессинговыйЦентр");
		ТекстНстр = Нстр("ru = 'Интеграция с системой взимания платы ""Платон"" и ""Автодор"" не доступна в текущей версии программы. Интеграция доступна в версии ПРОФ и КОРП'");
		ПоказатьПредупреждение(, ТекстНстр);
		Возврат;
	КонецЕсли;
	
	Объект.ГлубинаПоискаПЛДоВыезда							 = Неопределено;
	Объект.ГлубинаПоискаПЛПослеВозвращения					 = Неопределено;
	Объект.ТолькоПроверенные								 = Неопределено;
	Объект.ОбрабатыватьРассчитанныеПутевыеЛисты				 = Неопределено;
	Объект.ПересчитатьПутевыеЛисты							 = Неопределено;
	Объект.КомментироватьХодВыполнения						 = Неопределено;
	Объект.ПроводитьСозданныеЗаправкиГСМ					 = Неопределено;
	Объект.СоздаватьСливыДляОтрицательныхЗаправок			 = Неопределено;
	Объект.ПроверятьНаличееДублейПоСозданнымРанееДокументам	 = Неопределено;
	Объект.ОткрыватьФормыЗаписанныхЗаправок					 = Неопределено;
	Объект.ТипСоответствияКолонок = 1;

	УстановитьВидимостьДоступность();
	ИнициализацияСоответствияКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСоответствияКолонокПриИзменении(Элемент)
	ОчиститьНомераИменаКолонок();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВнешняяСистемаПриИзменении(Элемент)
	
	Если Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаВзиманияПлаты")
		И уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.ПроцессинговыйЦентр");
		ТекстНстр = Нстр("ru = 'Интеграция с системой взимания платы ""Платон"" и ""Автодор"" не доступна в текущей версии программы. Интеграция доступна в версии ПРОФ и КОРП'");
		ПоказатьПредупреждение(, ТекстНстр);
		Возврат;
	КонецЕсли;

	Объект.ГлубинаПоискаПЛДоВыезда							 = Неопределено;
	Объект.ГлубинаПоискаПЛПослеВозвращения					 = Неопределено;
	Объект.ТолькоПроверенные								 = Неопределено;
	Объект.ОбрабатыватьРассчитанныеПутевыеЛисты				 = Неопределено;
	Объект.ПересчитатьПутевыеЛисты							 = Неопределено;
	Объект.КомментироватьХодВыполнения						 = Неопределено;
	Объект.ПроводитьСозданныеЗаправкиГСМ					 = Неопределено;
	Объект.СоздаватьСливыДляОтрицательныхЗаправок			 = Неопределено;
	Объект.ПроверятьНаличееДублейПоСозданнымРанееДокументам	 = Неопределено;
	Объект.ОткрыватьФормыЗаписанныхЗаправок					 = Неопределено;
	Объект.ТипСоответствияКолонок = 1;

	УстановитьВидимостьДоступность();
	ИнициализацияСоответствияКолонок();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствиеКолонок

&НаКлиенте
Процедура СоответствиеКолонокИспользованиеПриИзменении(Элемент)
	ТекСтрока = Элементы.СоответствиеКолонок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ИмяКолонкиФайла) И НЕ ТекСтрока.Использование Тогда
		ТекСтрока.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеКолонокИмяКолонкиФайлаПриИзменении(Элемент)
	ТекСтрока = Элементы.СоответствиеКолонок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ИмяКолонкиФайла) И НЕ ТекСтрока.Использование Тогда
		ТекСтрока.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеКолонокНомерКолонкиФайлаПриИзменении(Элемент)
	ТекСтрока = Элементы.СоответствиеКолонок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.НомерКолонкиФайла) И НЕ ТекСтрока.Использование Тогда
		ТекСтрока.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуСервер();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьНомераИменаКолонок()
	Для Каждого ТекСтрока Из Объект.СоответствиеКолонок Цикл
		Если Объект.ТипСоответствияКолонок = 0 Тогда
			ТекСтрока.НомерКолонкиФайла = 0;
		Иначе
			ТекСтрока.ИмяКолонкиФайла = "";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	флагПЦ = Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.ПроцессинговыйЦентр");
	Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	
	Элементы.ГруппаНастройкиДополнительноИнформация.Видимость = Истина;
	Если флагПЦ Тогда
		Элементы.ГруппаЗагрузкаЗаправок.Видимость	 = Истина;
		Элементы.ГруппаНастройки.Видимость			 = Истина;
	ИначеЕсли Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаВзиманияПлаты")
		ИЛИ Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СервисСтрахования") Тогда
		Элементы.ГруппаЗагрузкаЗаправок.Видимость	 = Ложь;
		Элементы.ГруппаНастройки.Видимость			 = Истина;
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет; 
	ИначеЕсли Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаМониторинга") Тогда
		Элементы.ГруппаЗагрузкаЗаправок.Видимость	 = Истина;
		Элементы.ГруппаНастройки.Видимость			 = Ложь;
		Элементы.ГруппаНастройкиДополнительноИнформация.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЗагрузкаЗаправок.Видимость	 = Ложь;
		Элементы.ГруппаНастройки.Видимость			 = Ложь;
		Элементы.Страницы.ОтображениеСтраниц		 = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	Элементы.ТолькоПроверенные.Видимость						 = флагПЦ;
	Элементы.СоздаватьСливыДляОтрицательныхЗаправок.Видимость	 = флагПЦ;
	Элементы.ФлажокКомментироватьХодВыполнения.Видимость		 = флагПЦ; 
	Элементы.ОткрыватьФормыЗаписанныхЗаправок.Видимость			 = флагПЦ;

	
	Элементы.ГруппаНастройки.Видимость          = НЕ Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПрофилиОбменаСВнешнимиСистемами.Роснефть");
	Элементы.УчитыватьНаценкиСкидки.Видимость   = Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПрофилиОбменаСВнешнимиСистемами.Роснефть");
	Элементы.СтраницаЗагрузкаДанныхПЦ.Видимость = НЕ (Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПрофилиОбменаСВнешнимиСистемами.ППР")
		ИЛИ Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПрофилиОбменаСВнешнимиСистемами.Лукойл")
		ИЛИ Объект.ТипСистемы = ПредопределенноеЗначение("Перечисление.уатТипыВнешнихСистем.СистемаМониторинга"));
		
	Элементы.ЗаполнитьПоШаблону.Видимость = Объект.Предопределенный;
	
	Если Объект.ТипСоответствияКолонок = 0 Тогда
		Элементы.СоответствиеКолонокИмяКолонкиФайла.Видимость = Истина;
		Элементы.СоответствиеКолонокНомерКолонкиФайла.Видимость = Ложь;
	Иначе
		Элементы.СоответствиеКолонокИмяКолонкиФайла.Видимость = Ложь;
		Элементы.СоответствиеКолонокНомерКолонкиФайла.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияСоответствияКолонок()
	
	Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонок(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуСервер()
	Если Объект.Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Газпромнефть Тогда
		Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонокГазпромнефть(Объект);
	ИначеЕсли Объект.Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.ПлатонВыпискаОпераций Тогда
		Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонокПлатонВыпискаОпераций(Объект);
	ИначеЕсли Объект.Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.ПлатонЛогистическийОтчет Тогда
		Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонокПлатонЛогистическийОтчет(Объект);
	ИначеЕсли Объект.Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Автодор Тогда  
		Справочники.уатПрофилиОбменаСВнешнимиСистемами.ИнициализацияСоответствияКолонокАвтодор(Объект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
